Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: This means that the pupils learn to understand the connections between individual choices, societal structures and balance in nature.
nb: Faget skal gi kunnskap om og forståelse for religioner og livssyn lokalt, nasjonalt og globalt og på individ-, gruppe- og tradisjonsnivå.

source: Some five-year-olds seemed well-adjusted.
nb: • Noen femåringer virket veltilpass.

source: Reading in art and crafts involves being able to interpret, understand and assess visual and material surroundings.
nb: Å kunne lese i kunst og håndverk er å tolke, forstå og vurdere visuelle og materielle omgivelser.

source: ‘I prefer to see it as a strength.
nb: – Jeg tror heller det er en styrke.

source: Respect for the views of individuals and local communities should be paramount.
nb: Det må utøves varsomhet ved valg av arbeidsmåter.

source: The record-keeping is among other things, important for an interdisciplinary collaboration.
nb: Dokumentasjonen er blant annet avgjørende for å få til et tverr­faglig ­samarbeid.

source: give an account of and evaluate the use of sources
nb: gjøre rede for og vurdere kildebruk

source: read literary texts in a variety of genres
nb: lese litterære tekster i ulike sjangere

source: ‘We saw a lot of the former at circle time.
nb: – Det første så vi mye av i samlingsstunden.

source: read simple texts with coherence and understanding
nb: avlese enkle tekster med sammenheng og forståelse

source: It is not about rules, there are far fewer rules here than in many other kindergartens.
nb: Den handler ikke om disiplin, for regler er det langt færre av i denne barnehagen enn i mange andre.

source: explore measurements for area and volume in practical situations and
nb: utforske mål for areal og volum i praktiske situasjoner og representere

source: assess whether the solutions are valid
nb: vurdere om løsninger er gyldige

source: use grammatical terms to compare Nynorsk and Bokmål
nb: bruke ulike medier, kilder og estetiske uttrykk i egne norskfaglige og tverrfaglige tekster

source: Both girls and boys must have the opportunity to gain rich experiences from the subject of Mathematics that create positive attitudes to and solid competence in the subject.
nb: Det må legges til rette for at både jenter og gutter får rike erfaringer med matematikkfaget, som skaper positive holdninger og en solid fagkompetanse.

source: Intercultural understanding and the development of linguistic self-confidence are key aspects of the teaching.
nb: Interkulturell forståelse og utvikling av språklig selvtillit og trygghet står sentralt i opplæringen.

source: the causes and consequences of key historical and contemporary conflicts, and
nb: årsaker til og konsekvenser av sentrale historiske og nåtidige konflikter og

source: The main subject area deals with the use and manipulation of polynomials and rational expressions, and analysis and calculation of finite sums and infinite series.
nb: Hovedområdet handler om regning med og manipulasjon av polynomer og rasjonale uttrykk, og analyse og beregning av endelige og uendelige summer av tall.

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in exploring different representations and problem solving strategies and arguing using mathematical terminology.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i å utforske ulike representasjoner og problemløsingsstrategier og i å argumentere med matematiske begreper.

source: explain the basics of climatic and weather conditions by using theories of radiation balance, water circulation and atmospheric currents
nb: forklare klimatiske grunntrekk og værforhold ved å bruke teoriene om strålingsbalanse, vannets kretsløp og strømninger i atmosfæren

source: This main subject area focuses on important features of the ethics of Christianity, important texts from Christianity, and aesthetic and ritual expressions.
nb: I dette hovedområdet blir det lagt vekt på viktige trekk ved kristendommens etikk, sentrale tekster fra kristendommen, og estetiske og rituelle uttrykk.

source: This main subject area deals with how organic substances react.
nb: Hovedområdet handler om hvordan organiske stoffer reagerer.

source: Numeracy in arts and crafts involves being able to use mathematical approaches in practical creative work.
nb: Å kunne regne i kunst og håndverk er å bruke matematiske framgangsmåter i praktisk skapende arbeid.

source: present different forms of expression from art and music related to Christianity
nb: presentere ulike uttrykk fra kunst og musikk knyttet til kristendommen

source: interpret and evaluate complex composite texts
nb: beskrive og sammenligne de nordiske lands språksituasjon og språkpolitikk

source: It can sometimes be difficult to strike a balance between supporting one person and oppressing someone else.
nb: Balansegangen mellom å støtte noen og å undertrykke andre kan noen ganger være vanskelig.

source: use commutative, associative and distributive properties to explore and
nb: bruke kommutative, assosiative og distributive egenskaper til å

source: process, factor and simplify algebraic expressions, tie expressions to practical situations, calculate using formulas, brackets and fraction expressions and use square expressions
nb: behandle, faktorisere og forenkle algebrauttrykk, knytte uttrykkene til praktiske situasjoner, regne med formler, parenteser og brøkuttrykk og bruke kvadratsetningene

source: home-kindergarten cooperation and other matters relating to the kindergarten.
nb: mellom hjem og barnehage og andre forhold ved barnehagen.

source: Digital skills in mathematics refers to the ability to use graphing tools, spreadsheets, CAS, dynamic geometry software and programming to explore and solve mathematical problems.
nb: Digitale ferdigheter i fordypning i matematikk innebærer å bruke graftegner, regneark, CAS, dynamisk geometriprogram og programmering til å utforske og løse matematiske problemer.

source: Some participate actively in play.
nb: Noen deltar aktivt i leken.

source: explore how digital tools and new technology may provide possibilities
nb: utforske hvordan digitale verktøy og ny teknologi kan gi muligheter for

source: ‘We take a common sense approach.
nb: – Her bruker vi sunn fornuft.

source: Sandseter and Seland found that most of the children enjoyed the field trips immensely.
nb: Sandseter og Seland fant ut at de fleste av barna likte turene godt.

source: The staff is concerned about – and believe it’s important – to do a complete evaluation of the children.
nb: De ansatte der er jo opptatt av – og synes det er viktig – å gjøre en ­helhetsvurdering av barnet.

source: That can weigh too heavily on a child.
nb: Det kan bli en for tung byrde for barnet å løfte.

source: The adaptation of usage to different social and cultural situations is included in the main subject area.
nb: Tilpassing av språkbruk til ulike sosiale og faglige situasjoner knyttet til litteratur og kultur står sentralt i hovedområdet.

source: Participation and observation at joint meetings
nb: Barnehagene har klagerett på tildelingen som gjøres i enkeltvedtaket.

source: Social science modes of thought
nb: Sosiologi og sosialantropologi

source: Student progress meetings can be conducted on the green and yellow levels in keeping with the regular infection control recommendations.
nb: I barnehagen vil kohorter være det viktigste utgangspunktet for smittebegrensning og eventuell sporing av smitte, og anbefales benyttet på gult og rødt nivå.

source: usually be vulnerable under normal circumstances.
nb: Det er også viktig å være oppmerksom på ungdom som under normale

source: language and culture
nb: språk og kultur

source: Media and information knowledge 2
nb: Medie- og informasjonskunnskap 2

source: express their own thoughts about persons and actions from Norwegian TV programmes, films and plays
nb: uttrykke egne tanker om personer og handlinger i norske TV-programmer, filmer og teaterstykker

source: Teaching English in Norwegian Classrooms.
nb: Digital læring i skole og lærerutdanning.

source: use appropriate vocabulary to discuss specialist topics, talk about their own experiences and express their thoughts and opinions
nb: begrunne egne tekstvalg, og gi uttrykk for egne tanker og opplevelser om barnelitteratur, teater, filmer, dataspill og TV-programmer

source: This has been the case for many years.
nb: Slik har det vært i mange år.

source: in English means being able to supplement mathematical competence in one's native language with the necessary terms in English.
nb: i engelsk innebærer at en kan supplere regnekompetansen på morsmålet med de nødvendige uttrykk på engelsk.

source: register and interpret traces left by the Ice Age in the place where one lives and explain what the Ice Age meant to the formation of the terrain and the country as a whole
nb: registre og tolke spor etter istiden på hjemstedet og forklare istidens betydning for landskapsdannelse og landet som helhet

source: talk about their own work in learning the new language and their use of different learning strategies
nb: samtale om eget arbeid med å lære det nye språket og bruk av ulike læringsstrategier

source: in KRLE involves being able to express knowledge and viewpoints about religion and philosophies of life, ethics and philosophy.
nb: i KRL innebærer å kunne uttrykke kunnskaper, erfaringer og forestillinger om religion og livssyn, etikk og filosofi.

source: All teachers who had students participating in TIMSS Advanced in mathematics were asked about their education.
nb: Alle lærerne som hadde elever som deltok i TIMSS Advanced i matematikk fikk spørsmål om hvilken utdanning de hadde.

source: The interaction between natural science and technology is a key part of this main subject area.
nb: Samspillet mellom naturvitenskap og teknologi står sentralt i dette hovedområdet.

source: The pupils demonstrate and develop competence in the subject in year 7 when they explore and reflect on mathematical relationships, use mathematical terminology in communication and use different representations and problem solving strategies.
nb: Elevene viser og utvikler kompetanse i faget på 7. trinn når de utforsker og reflekterer over matematiske sammenhenger, benytter matematiske begreper i kommunikasjonen og bruker ulike representasjoner og problemløsingsstrategier.

source: use this in one’s own mental arithmetic and problem solving
nb: og bruke det i hoderegning og problemløsing

source: explore and present one’s work on contemporary topics or debates
nb: bruke redskaper, grunnleggende teknikker og matlagingsmetoder til å

source: All the same, they mention how restlessness and excitement are also part of their assessments.
nb: Likevel setter de ord på hvordan uro og begeistring også er del av skjønnsvurderingene.

source: Knowledge of current rules and ethical norms for the use of information technology is a central theme in this subject.
nb: Kjennskap til gjeldende regelverk og etiske normer for bruk av informasjonsteknologi er sentralt.

source: Bacteria are much easier to study.
nb: Bakterier er mye enklere å studere.

source: measure and compare the measurement units of length and area,
nb: måle og sammenligne størrelser som gjelder lengde og areal, ved hjelp

source: discuss and elaborate on the relationship between love and sexuality in light of cultural norms
nb: samtale om forholdet mellom kjærlighet og seksualitet i lys av kulturelle og religiøse normer

source: The overall mealtime experience led to several unfortunate working postures for the adults’, reports Jordal.
nb: Totalt sett kunne måltidene derfor skape flere uheldige arbeidsstillinger for de voksne, forteller Jordal.

source: Click on the word that, in this context means the same as “lived on”.
nb: Elevenes sosiale læring og utvikling kan beskytte mot krenkelser og mobbing, og påvirke det psykososiale

source: Formative assessment shall help to promote learning and develop competence in the subject.
nb: Underveisvurderingen skal bidra til å fremme læring og til å utvikle kompetanse i faget.

source: These main subject areas supplement each other and must be considered together.
nb: Hovedområdene utfyller hverandre og må sees i sammenheng.

source: The aims of the studies are to enable pupils to
nb: forklare hva filosofi og etikk er

source: examine and describe factors that influence the germination and growth of plants
nb: undersøke og beskrive faktorer som påvirker frøspiring og vekst hos planter

source: Reading composite texts involves understanding composition and structure in different types of audio and visual impressions, as well as the interaction between these forms of expression.
nb: Å lese sammensatte tekster innebærer å forstå komposisjon og struktur i ulike typer visuelle og auditive uttrykk, og samspillet mellom de involverte uttrykksformene.

source: This finding emerged from research done by Anna Ehrlin.
nb: Dette viser forskningen til Anna Ehrlin.

source: Information to parents about the Parent Survey for kindergartens.
nb: Til foreldre om foreldreundersøkelsen i barnehage.

source: give an account of Sami language rights in Norway and of the prevalence of the Sami languages
nb: oppfatte og forstå ord og uttrykk i tilpassede tekster bruke noen vanlige tegn/småord, høflighetsuttrykk og enkle fraser og

source: The teacher shall facilitate for pupil participation and stimulate their desire to learn by allowing the pupils to explore mathematics through moving, playing, being creative and having a sense of wonder.
nb: Læreren skal legge til rette for elevmedvirkning og stimulere til lærelyst ved at elevene får utforske matematikk gjennom å bevege seg, leke, være kreative og undre seg.

source: The youngest children also appear to like being in kindergarten.
nb: Også de yngste barna ser stort sett ut til å trives godt i barnehagen.

source: talk about tolerance and how encounters between different cultures may be rewarding and may lead to conflicts
nb: samtale om toleranse og respekt i flerkulturelle samfunn og om hvordan møter mellom forskjellige kulturer både kan påvirke og berike hverandre

source: Information technology comprises two programme subjects: Information technology 1 and Information technology 2.
nb: Informasjonsteknologi består av to programfag: informasjonsteknologi 1 og informasjonsteknologi 2.

source: The social studies subject shall develop knowledge on working life and economics.
nb: Opplæringen i samfunnsfag skal bidra til undersøkelse av naturlige og menneskeskapte forhold på jorda og til beskrivelse av steder.

source: write texts with a clear objective, good structure and cohesion
nb: lese og tolke eksperimenterende og modernistiske tekster

source: explore and explain relationships between addition and subtraction and
nb: utforske og forklare sammenhenger mellom addisjon og subtraksjon

source: give an account of water as a solvent for polar and non-polar substances
nb: gjøre rede for vann som løsemiddel for polare og upolare stoffer

source: The teaching based on this curriculum and on the curriculum for basic Norwegian is meant to promote adapted education in accordance with current regulations in the Education Act.
nb: Opplæringen etter denne læreplanen skal sammen med læreplanen i grunnleggende norsk fremme tilpasset opplæring i henhold til gjeldende bestemmelser i Opplæringsloven.

source: dimensional figures, and explain what properties the figures have in common, and what properties distinguish them from one another
nb: tredimensjonale figurer og forklare hvilke egenskaper figurene har felles, og hvilke egenskaper som skiller dem fra hverandre

source: describe some important characteristics of the four seasons by observing nature
nb: gjenkjenne og beskrive noen plante- og dyrearter og sortere dem

source: Civic life is integrated in each main subject area.
nb: Samfunnskunnskap integreres i hvert hovedområde.

source: explore how interests and ideological points of view affect our
nb: kjenne igjen og gjøre rede for grunnsmaker i matvarer og fortelle om og

source: The programme subject Politics, the individual and society shall generate knowledge, develop skills and foster attitudes related to life and living together with others in a society.
nb: Programfaget politikk, individ og samfunn skal utvikle kunnskap, ferdigheter og holdninger knyttet til liv og virke sammen med andre i et samfunn.

source: Curriculum for the elective subject of traffic (TRA1-01)
nb: Læreplan i valgfaget trafikk (TRA1-01)

source: discuss the ramifications of there being many active users of the media who themselves play a role in developing the media product
nb: kjærlighet og kjønnsroller, helt og antihelt, virkelighet og fantasi, makt og motmakt, løgn og sannhet, oppbrudd og ansvar

source: Øverland asked herself.
nb: spurte Øverland seg om.

source: recognise humanistic art and make use of aesthetic expression related to Humanism
nb: gjenkjenne kunst og gjøre bruk av estetiske uttrykk knyttet til humanisme

source: The development of oral skills in Social science begins with learning to listen and expressing one’s opinion in simple oral texts and gradually develops to expressing basic viewpoints and listening to others from a secure professional point of view.
nb: Utvikling av muntlige ferdigheter i samfunnsfag går fra å lytte til og uttrykke meninger i enkle muntlige tekster til å ytre seg med grunngitte synspunkter og lytte til andre med faglig trygghet.

source: present a person from history and discuss how contemporary social frameworks influenced the actions of this person
nb: lese og fortelle om engelskspråklig barne- og ungdomslitteratur fra ulike medier og sjangere, deriblant tekster av og om døve

source: Furthermore, it involves logical reasoning and problem solving.
nb: Videre dreier det seg om logisk resonnement og problemløsning.

source: Anna says nothing, but abruptly stands up and pulls on Bjørn’s sleeve, as though she were trying to get him away from the racetrack.
nb: Anna sier ingenting, men plutselig reiser hun seg opp og drar i armen til Bjørn, som om hun vil få ham bort fra bilbanen.

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics and solve mathematical problems by being creative, reasoning and reflecting.
nb: Læreren skal legge til rette for elevmedvirkning og stimulere til lærelyst ved at elevene får utforske matematikk og løse matematiske problemer gjennom å velge strategier, være kreative, resonnere og reflektere.

source: The fact that it appears to be little importance attached to the development of such skills in Norwegian schools, can therefore be a contributory factor to the generally weak results in mathematics at all school levels in Norway.
nb: At det synes å bli lagt liten vekt på å utvikle slike ferdigheter i norsk skole, kan derfor være en medvirkende årsak til de generelt svake norske resultatene i matematikk på alle nivåer i skolen.

source: Representation in mathematics means ways of expressing mathematical concepts, relationships and problems.
nb: Elevene må få mulighet til å bruke matematiske representasjoner i ulike sammenhenger gjennom egne erfaringer og matematiske samtaler.

source: The school owner / the school decide whether mother tongue teaching shall be given in accordance with the curriculum for basic Norwegian for language minorities or in the form of special adaptation within the regular curriculum in Norwegian.
nb: Skoleeier/skolen velger om den særskilte norskopplæringen skal gis etter læreplanen i grunnleggende norsk for språklige minoriteter eller i form av særskilt tilpasning innenfor den ordinære læreplanen i norsk.

source: This main subject area focuses on humanism in a historical and contemporary perspective.
nb: Hovedområdet dreier seg videre om livssynshumanismen i et historisk og et aktuelt perspektiv.

source: By holding her camcorder at child level, about 80 cm from the floor, Grunditz discovered many things that she had never noticed when working in a preschool, for example, the level of sophistication involved in cooperation between children and adults.
nb: Med videokameraet plassert i barnehøyde, 80 cm over bakken, oppdaget Grunditz mye hun aldri selv hadde lagt merke til da hun jobbet i barnehage.

source: explain the construction of simple systems and components in gearing, steering and braking mechanisms and how they work
nb: forklare oppbygning av og virkemåte til enkle systemer og komponenter i drivverk, styring og bremser

source: talk about what we mean by identity and culture, recognise cultural symbols and prepare a visual presentation of them
nb: samtale om hva som forbindes med identitet og kultur, gjenkjenne kulturelle uttrykk og lage en visuell presentasjon av dem

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics and solve mathematical problems by being creative, and by reasoning and reflecting.
nb: Læreren skal legge til rette for elevmedvirkning og stimulere til lærelyst ved at elevene får utforske matematikk og løse matematiske problemer gjennom å være kreative, resonnere og reflektere.

source: carry out relevant experiments in the main subject areas, with and without digital tools
nb: bruke fagkunnskap fra egne programfag i foredrag og presentasjoner på norsk eller tegnspråk

source: ‘We want the children to enjoy playing outdoors, to learn to master skills and to love nature.
nb: – Vi er opptatt av at barna skal få gleden av å utfolde seg ute, mestre og bli glad i naturen.

source: Level Vg2 vocational study programmes
nb: Vg2 yrkesfaglige utdanningsprogram

source: The teacher and pupils shall engage in dialogue about their development in mathematics.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i matematikk.

source: make and explore geometric patterns, with and without using digital tools, and describe them orally
nb: lage og utforske geometriske mønster, både med og uten digitale verktøy, og beskrive dem muntlig

source: She tells a story about two-year-old Bjørn who is sitting quietly, enthralled in playing with a plastic racetrack.
nb: Hun forteller en historie om toåringen Bjørn som sitter og leker konsentrert med en bilbane i plast.

source: The pupils shall have the opportunity to experiment without the fear of failure.
nb: Elevene skal få mulighet til å prøve og feile.

source: The programme subject covers trouble-shooting components, equipment and machines, as well as the repair and maintenance of these.
nb: Programfaget omfatter feilsøking, reparasjon og vedlikehold av komponenter, utstyr og maskiner.

source: ‘In organising activities, preschool staff must be cognisant of these gender differences, assuming that the goal is to foster increased physical activity for the girls’, she adds.
nb: – I tilretteleggingen av aktiviteter må barnehagepersonalet være bevisste på disse kjønnsforskjellene, hvis målet er å fremme økt fysisk aktivitet for jentene, sier hun.

source: assemble relevant installations and structures according to relevant standards and principles for universal design
nb: montere aktuelle installasjoner og konstruksjoner etter gjeldende standarder og prinsipper for universell utforming

source: Malin comes over and destroys it.
nb: Da kommer Malin bort og ødelegger den.
